Repository: hafizd-kurniawan/flutter-dev-pos
Catalog: lib/l10n/app_*.arb
Languages: id

source: Orders
id: Pesanan

source: History
id: Riwayat

source: Settings
id: Pengaturan

# search_placeholder
source: Search...
id: Cari...

# cart_title
source: Cart
id: Keranjang

source: Checkout
id: Bayar

source: Success
id: Berhasil

source: Error
id: Gagal

source: Cancel
id: Batal

source: Confirm
id: Konfirmasi

source: Please wait
id: Mohon tunggu

source: Login
id: Masuk

source: Logout
id: Keluar

source: Password
id: Kata Sandi

# payment_success
source: Payment Successful!
id: Pembayaran Berhasil!

source: Payment Failed
id: Pembayaran Gagal

source: Items
id: Item

source: Tax
id: Pajak

source: Service Charge
id: Biaya Layanan

source: Discount
id: Diskon

source: Change
id: Kembalian

source: Cash
id: Tunai

source: Print Receipt
id: Cetak Struk

source: New Order
id: Pesanan Baru

source: Sync Data
id: Sinkronisasi Data

source: Notifications
id: Notifikasi

# about
source: About & Help
id: Tentang & Bantuan

source: Language
id: Bahasa

source: Select Language
id: Pilih Bahasa

source: App Info
id: Info Aplikasi

source: Server Sync
id: Sinkronisasi Server

source: Preferences
id: Preferensi

source: From
id: Dari

source: To
id: Sampai

source: ALERTS
id: PERINGATAN

# low_stock_count
source: {count} products low stock
id: {count} produk stok menipis

# pending_orders_count
source: {count} pending orders
id: {count} pesanan tertunda

# upgrade_premium_desc
source: Upgrade to Premium to get:
id: Upgrade ke Premium untuk:

source: View Dashboard
id: Lihat Dashboard

source: Retry
id: Coba Lagi

source: No Items
id: Tidak Ada Item

source: Stock Insufficient
id: Stok Tidak Cukup

source: No tax available
id: Tidak ada pajak tersedia

source: No discount available
id: Tidak ada diskon tersedia

source: No service available
id: Tidak ada layanan tersedia

source: No table data
id: Tidak ada data meja

# welcome_dashboard
source: Welcome to Dashboard
id: Selamat Datang di Dashboard

# error_loading_categories_msg
source: Error loading categories: {message}
id: Gagal memuat kategori: {message}

source: Select Table
id: Pilih Meja

source: Search table...
id: Cari meja...

source: No table available
id: Tidak ada meja tersedia

source: Select Tax
id: Pilih Pajak

source: No Tax
id: Tanpa Pajak

# no_tax_desc
source: Do not use tax
id: Tidak menggunakan pajak

# tax_applied
source: Tax applied successfully
id: Pajak berhasil diterapkan

source: Select Discount
id: Pilih Diskon

source: No Discount
id: Tanpa Diskon

# no_discount_desc
source: Do not use discount
id: Tidak menggunakan diskon

# discount_applied
source: Discount applied successfully
id: Diskon berhasil diterapkan

source: Select Service
id: Pilih Layanan

source: No Service
id: Tanpa Layanan

# no_service_desc
source: Do not use service charge
id: Tidak menggunakan biaya layanan

# service_applied
source: Service {name} applied
id: Layanan {name} diterapkan

source: Save
id: Simpan

source: All Categories
id: Semua Kategori

# order_number
source: Order#
id: Pesanan#

# order_note_label
source: Order Note:
id: Catatan Pesanan:

# order_note_hint
source: Add a note for the kitchen...
id: Tambahkan catatan untuk dapur...

# refresh_error
source: Failed to refresh {count} items: {message}
id: Gagal menyegarkan {count} item: {message}

# refresh_failed
source: Refresh failed: {message}
id: Penyegaran gagal: {message}

source: Qty
id: Jml

source: Price
id: Harga

# proceed_payment
source: Proceed to Payment
id: Lanjutkan Pembayaran

# stock_validation_failed
source: Stock validation failed: {message}
id: Gagal validasi stok: {message}

# select_table_dine_in
source: Select table first for Dine In
id: Pilih meja terlebih dahulu untuk Dine In

# stock_insufficient_title
source: Stock Insufficient
id: Stok Tidak Cukup

# stock_insufficient_message
source: Stock insufficient
id: Stok tidak cukup

source: Table Selected
id: Meja Dipilih

source: Takeaway (No Table)
id: Bungkus (Tanpa Meja)

source: Tap to select table
id: Ketuk untuk pilih meja

source: No table needed
id: Tidak perlu pilih meja

source: Dine In
id: Makan di Tempat

source: Takeaway
id: Bungkus

source: History Orders
id: Riwayat Pesanan

source: Filter Date Range
id: Filter Rentang Tanggal

source: Start Date
id: Tanggal Mulai

source: End Date
id: Tanggal Akhir

source: Select Start Date
id: Pilih Tanggal Mulai

source: Select End Date
id: Pilih Tanggal Akhir

source: Clear Filter
id: Hapus Filter

source: Apply Filter
id: Terapkan Filter

source: Filter Active
id: Filter Aktif

source: Filter by Date
id: Filter berdasarkan Tanggal

source: Update Status
id: Perbarui Status

# start_cooking_confirm
source: Start Cooking?
id: Mulai Memasak?

# mark_complete_confirm
source: Mark as Complete?
id: Tandai Selesai?

source: Order Note:
id: Catatan Pesanan:

source: Printing receipt...
id: Mencetak struk...

source: No printer found
id: Printer tidak ditemukan

# error_printing
source: Error printing: {message}
id: Gagal mencetak: {message}

source: Loading data...
id: Memuat data...

source: Error loading orders
id: Gagal memuat pesanan

source: Avg Order
id: Rata-rata

source: Customers
id: Pelanggan

source: Transaction Report
id: Laporan Transaksi

source: Item Sales Report
id: Laporan Penjualan Item

source: Product Sales Chart
id: Grafik Penjualan Produk

source: Summary Sales Report
id: Ringkasan Penjualan

source: Confirm Payment
id: Konfirmasi Pembayaran

source: Enter customer name
id: Masukkan nama pelanggan

# qr_data_empty
source: Error: QR Data is Empty
id: Error: Data QR Kosong

# order_note_example
source: Example: No spicy, less ice
id: Contoh: Jangan pedas, Es sedikit

source: Email Address
id: Alamat Email

source: Sign In
id: Masuk

source: Clear
id: Bersihkan

source: Done
id: Selesai

source: Print
id: Cetak

source: Receipt
id: Struk

source: Back
id: Kembali

source: Print Checker
id: Cetak Checker

# new_order_received
source: New Order Received! History Updated.
id: Pesanan Baru Diterima! Riwayat Diperbarui.

source: Order Summary
id: Ringkasan Pesanan

source: Payment Details
id: Rincian Pembayaran

source: Customer Name
id: Nama Pelanggan

source: Payment Method
id: Metode Pembayaran

source: Cash Amount
id: Jumlah Tunai

source: Exact Amount
id: Uang Pas

# customer_name_required
source: Customer name is required!
id: Nama pelanggan wajib diisi!

# customer_name_required_takeaway
source: Customer name is required for Takeaway!
id: Nama pelanggan wajib diisi untuk Takeaway!

# payment_amount_insufficient
source: Payment amount is insufficient!
id: Nominal pembayaran kurang!

# payment_qris
source: QRIS Payment
id: Pembayaran QRIS

# scan_qris
source: Scan QRIS to make payment
id: Scan QRIS untuk membayar

source: Print QRIS
id: Cetak QRIS

source: Item Note
id: Catatan Item

# max_chars
source: Max 100 characters
id: Maksimal 100 karakter

source: Add Note
id: Tambah Catatan

source: Order Type
id: Tipe Pesanan

source: Total Bill
id: Total Tagihan

source: Payment Amount
id: Nominal Bayar

source: ⚠️ Money insufficient!
id: ⚠️ Uang kurang!

source: Payment Time
id: Waktu Pembayaran

source: Generating PDF...
id: Membuat PDF...

# receipt_shared_success
source: Receipt shared successfully!
id: Struk berhasil dibagikan!

# error_sharing_receipt
source: Error sharing receipt: {error}
id: Gagal membagikan struk: {error}

# order_saved_success
source: Order Saved Successfully
id: Pesanan Berhasil Disimpan

# printer_name
source: Print Name
id: Nama Printer

# printer_address
source: Address
id: Alamat

source: Test Print
id: Tes Print

# search_food_placeholder
source: Search for food, coffee, etc..
id: Cari makanan, kopi, dll..

source: Search tables...
id: Cari meja...

# search_generic
source: Search
id: Cari

source: Coming Soon
id: Segera Hadir

# customer_name_hint
source: Customer Name
id: Nama Pelanggan

# total_price_hint
source: Total Price
id: Total Harga

source: Close
id: Tutup

source: Manage Printer
id: Kelola Printer

source: No data available
id: Data tidak tersedia

# notification_preview
source: This is how notifications will appear
id: Ini adalah tampilan notifikasi

source: Test Notification
id: Tes Notifikasi

source: IP Address
id: Alamat IP

source: Paper Size
id: Ukuran Kertas

source: Printer Type
id: Tipe Printer

source: Sync Products Now
id: Sinkronisasi Produk Sekarang

source: Sync Orders Now
id: Sinkronisasi Order Sekarang

# status_available
source: Available
id: Tersedia

# tooltip_refresh_data
source: Refresh Data
id: Segarkan Data

# tooltip_print_receipt
source: Print Receipt
id: Cetak Struk

# tooltip_share_receipt
source: Share Receipt
id: Bagikan Struk

# tooltip_refresh_orders
source: Refresh Orders
id: Segarkan Pesanan

source: Notification Sound
id: Suara Notifikasi

# notification_sound_desc
source: Play sound when notifications arrive
id: Mainkan suara saat notifikasi masuk

source: New Order Alerts
id: Notifikasi Pesanan Baru

# new_order_alerts_desc
source: Get notified when new orders arrive
id: Dapatkan notifikasi saat ada pesanan baru

source: Low Stock Alerts
id: Notifikasi Stok Menipis

# low_stock_alerts_desc
source: Get notified when products are running low
id: Dapatkan notifikasi saat stok produk menipis

# new_order_body
source: You have {count} paid orders.
id: Anda memiliki {count} pesanan lunas.

# app_title
source: POS Resto App
id: Aplikasi POS Resto

source: Error loading categories
id: Gagal memuat kategori

# discount_label
source: Discount:
id: Diskon:

# tax_label
source: Tax
id: Pajak

# service_label
source: Service
id: Layanan

source: Push Notifications
id: Notifikasi Push

# push_notifications_desc
source: Enable or disable all push notifications
id: Aktifkan atau nonaktifkan semua notifikasi push

# table_name_label
source: Table {name}
id: Meja {name}

# order_id_label
source: Order #{id}
id: Pesanan #{id}

source: Revenue
id: Pendapatan

source: Address
id: Alamat

# created_at
source: Created At: {date}
id: Dibuat Pada: {date}

# report_title_summary
source: HayoPOS | Summary Sales Report
id: HayoPOS | Laporan Ringkasan Penjualan

# report_title_transaction
source: HayoPOS | Transaction Sales Report
id: HayoPOS | Laporan Transaksi Penjualan

source: Time
id: Waktu

# feature_coming_soon
source: {feature} will be available in the next update.
id: {feature} akan tersedia pada pembaruan berikutnya.

source: Contact Support
id: Hubungi Dukungan

# phone_support
source: Phone: +62 123 4567 890
id: Telepon: +62 123 4567 890

source: Table Management
id: Manajemen Meja

source: Table Layout
id: Tata Letak Meja

source: Add Table
id: Tambah Meja

# table_name_input
source: Table Name
id: Nama Meja

source: Add
id: Tambah

source: Date
id: Tanggal

source: Receipt Number
id: No. Resi

source: Customer
id: Pelanggan

source: Cashier
id: Kasir

source: Table
id: Meja

source: Self Order
id: Mandiri

source: Note
id: Catatan

# subtotal_products
source: Subtotal {count} Products
id: Subtotal {count} Produk

# tax_pb1
source: Tax PB1 ({percent}%)
id: Pajak PB1 ({percent}%)

# service_charge_receipt
source: Service Charge ({percent}%)
id: Layanan ({percent}%)

# payment_method_receipt
source: Payment ({method})
id: Pembayaran ({method})

# paid_at
source: Paid at: {date}
id: Dibayar pada: {date}

# printed_by
source: Printed by: {name}
id: Dicetak oleh: {name}

source: Thank you
id: Terima kasih

# orders_table
source: Orders Table {name}
id: Pesanan Meja {name}

source: Payment
id: Pembayaran

source: Total Payment
id: Total Bayar

source: Pay
id: Bayar

# sign_in_subtitle
source: Sign in to manage your restaurant
id: Masuk untuk mengelola restoran Anda

source: Welcome Back
id: Selamat Datang Kembali

# copyright
source: © 2025 HayoPOS. All rights reserved.
id: © 2025 HayoPOS. Hak cipta dilindungi undang-undang.

source: Login Success
id: Berhasil Masuk

source: Process Payment
id: Proses Pembayaran

source: Start Cooking
id: Mulai Masak

source: Mark Complete
id: Tandai Selesai

# items_label
source: Items:
id: Item:

# language_settings
source: Language
id: Bahasa

# sync_data_desc
source: Sync data from and to server
id: Sinkronisasi data dari dan ke server

# notifications_desc
source: Manage notification preferences
id: Kelola preferensi notifikasi

# about_desc
source: App info and support
id: Info aplikasi dan dukungan

# language_desc
source: Change app language
id: Ubah bahasa aplikasi

# kitchen_printer_title
source: Kitchen Printer
id: Printer Dapur

# bar_printer_title
source: Bar Printer
id: Printer Bar

# receipt_printer_title
source: Receipt Printer
id: Printer Struk

# checker_printer_title
source: Checker Printer
id: Printer Checker

# paper_width
source: Width Paper
id: Lebar Kertas

# search_printer_title
source: Search Printer
id: Cari Printer

# bluetooth_enabled_msg
source: Bluetooth enabled, please search and connect
id: Bluetooth aktif, silakan cari dan hubungkan

source: Bluetooth not enabled
id: Bluetooth tidak aktif

source: Wait
id: Tunggu

# no_bluetooth_linked
source: There are no bluetooths linked, go to settings and link the printer
id: Tidak ada bluetooth terhubung, buka pengaturan dan hubungkan printer

# touch_to_connect
source: Touch an item in the list to connect
id: Sentuh item dalam daftar untuk menghubungkan

source: Connecting...
id: Menghubungkan...

# settings_saved
source: Settings saved successfully
id: Pengaturan berhasil disimpan

source: Printer disconnected
id: Printer terputus

source: Choose Size
id: Pilih Ukuran

source: Choose Printer
id: Pilih Printer

# printer_configuration_title
source: Printer Configuration
id: Konfigurasi Printer

# receipt_tab
source: Receipt
id: Struk

# bill_receipt_desc
source: Bill & Receipt
id: Tagihan & Struk

# kitchen_tab
source: Kitchen
id: Dapur

# food_orders_desc
source: Food Orders
id: Pesanan Makanan

# drink_orders_desc
source: Drink Orders
id: Pesanan Minuman

# configuration_title
source: Configuration
id: Konfigurasi

# receipt_printer_desc
source: To Print bill and receipt
id: Untuk mencetak tagihan dan struk

# kitchen_printer_desc
source: To print food to kitchen
id: Untuk mencetak makanan ke dapur

# bar_printer_desc
source: To print drink to bar
id: Untuk mencetak minuman ke bar

source: TODAY'S PERFORMANCE
id: PERFORMA HARI INI

source: Total Sales
id: Total Penjualan

source: ORDER TYPES
id: TIPE PESANAN

source: TOP 3 PRODUCTS
id: 3 PRODUK TERATAS

# sold_count
source: {count} sold
id: {count} terjual

source: UNLOCK FULL ANALYTICS
id: BUKA ANALITIK LENGKAP

# feature_profit_analysis
source: ✅ Profit Analysis
id: ✅ Analisis Keuntungan

# feature_customer_insights
source: ✅ Customer Insights
id: ✅ Wawasan Pelanggan

# feature_sales_trends
source: ✅ Sales Trends (7-30 days)
id: ✅ Tren Penjualan (7-30 hari)

# feature_export
source: ✅ Export PDF/Excel
id: ✅ Ekspor PDF/Excel

# feature_advanced_reports
source: ✅ Advanced Reports
id: ✅ Laporan Lanjutan

# free_trial_remaining
source: You have 1 FREE trial view remaining!
id: Anda memiliki 1 sisa tampilan uji coba GRATIS!

# error_open_web
source: Could not open web dashboard
id: Tidak dapat membuka dashboard web

# error_open_upgrade
source: Could not open upgrade page
id: Tidak dapat membuka halaman upgrade

# summary_sales_report_title
source: Summary Sales Report
id: Laporan Ringkasan Penjualan

# tax_col
source: Tax
id: Pajak

# discount_col
source: Discount
id: Diskon

# service_col
source: Service
id: Layanan

# cashier_col
source: Cashier
id: Kasir

# time_col
source: Time
id: Waktu

# order_col
source: Order
id: Pesanan

# product_col
source: Product
id: Produk

# qty_col
source: Qty
id: Jml

# price_col
source: Price
id: Harga

# total_price_col
source: Total Price
id: Total Harga

# no_transactions
source: No transactions at the moment.
id: Belum ada transaksi saat ini.

# customer_col
source: Customer
id: Pelanggan

# sync_col
source: Sync
id: Sinkron

# payment_status_col
source: Payment Status
id: Status Pembayaran

# payment_method_col
source: Payment Method
id: Metode Pembayaran

# payment_amount_col
source: Payment Amount
id: Jumlah Pembayaran

# service_charge_col
source: Service Charge
id: Biaya Layanan

# payment_col
source: Payment
id: Pembayaran

# action_col
source: Action
id: Aksi

# report_title
source: Report
id: Laporan

# revenue_label
source: REVENUE : {amount}
id: PENDAPATAN : {amount}

source: Not Synced
id: Belum

source: Synced
id: Sudah

# menu_order_title
source: Menu Order
id: Menu Pesanan

# table_management_title
source: Table Management
id: Manajemen Meja

# history_title
source: History
id: Riwayat

# settings_title
source: Settings
id: Pengaturan

source: Logout success
id: Berhasil keluar

source: Sync settings success
id: Sinkronisasi pengaturan berhasil

source: Sync settings failed
id: Sinkronisasi pengaturan gagal

source: Syncing settings...
id: Menyinkronkan pengaturan...

source: Choose Photo
id: Pilih Foto

# item_sales_report_title
source: Item Sales Report
id: Laporan Penjualan Item

# company_address_value
source: Jalan Melati No. 12, Mranggen, Demak, Central Java, 89568
id: Jalan Melati No. 12, Mranggen, Demak, Jawa Tengah, 89568

source: Normal Price
id: Harga Normal

source: Final Total
id: Total Akhir

source: Transaction ID
id: ID Transaksi

source: Order By
id: Dipesan Oleh

# scan_qris_below
source: Scan QRIS Below for Payment
id: Scan QRIS di Bawah untuk Pembayaran

# price_label
source: Price : {price}
id: Harga : {price}

# date_label
source: Date:
id: Tanggal:

# receipt_label
source: Receipt:
id: Resi:

# customer_label
source: Customer:
id: Pelanggan:

# cashier_label
source: Cashier:
id: Kasir:

# table_label
source: Table: {name}
id: Meja: {name}

# tax_label_receipt
source: Tax ({percent}%):
id: Pajak ({percent}%):

# service_label_receipt
source: Service ({percent}%):
id: Layanan ({percent}%):

# payment_label
source: Payment ({method}):
id: Pembayaran ({method}):

# change_label
source: Change:
id: Kembalian:

source: Table Checker
id: Pengecekan Meja

# kitchen_title
source: KITCHEN
id: DAPUR

# bar_title
source: Table Bar
id: Bar Meja

# completed_status
source: Completed
id: Selesai

# paid_status
source: Paid
id: Dibayar

# cooking_status
source: Cooking
id: Dimasak

# added_success
source: Successfully added
id: Berhasil ditambahkan

# stock_insufficient_cart
source: Stock insufficient! Available: {stock}, In cart: {cart}
id: Stok tidak cukup! Tersedia: {stock}, Di keranjang: {cart}

# stock_verification_failed
source: Cannot verify online stock. Added based on local stock.
id: Tidak dapat verifikasi stok online. Ditambahkan berdasarkan stok lokal.
